__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            (None, 576, 768, 3)  0
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 582, 774, 3)  0           input_2[0][0]
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 288, 384, 64) 9472        zero_padding2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_62 (BatchNo (None, 288, 384, 64) 256         conv2d_65[0][0]
__________________________________________________________________________________________________
activation_59 (Activation)      (None, 288, 384, 64) 0           batch_normalization_62[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 143, 191, 64) 0           activation_59[0][0]
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 143, 191, 64) 4160        max_pooling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_63 (BatchNo (None, 143, 191, 64) 256         conv2d_66[0][0]
__________________________________________________________________________________________________
activation_60 (Activation)      (None, 143, 191, 64) 0           batch_normalization_63[0][0]
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 143, 191, 64) 36928       activation_60[0][0]
__________________________________________________________________________________________________
batch_normalization_64 (BatchNo (None, 143, 191, 64) 256         conv2d_67[0][0]
__________________________________________________________________________________________________
activation_61 (Activation)      (None, 143, 191, 64) 0           batch_normalization_64[0][0]
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 143, 191, 256 16640       activation_61[0][0]
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 143, 191, 256 16640       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_65 (BatchNo (None, 143, 191, 256 1024        conv2d_68[0][0]
__________________________________________________________________________________________________
batch_normalization_66 (BatchNo (None, 143, 191, 256 1024        conv2d_69[0][0]
__________________________________________________________________________________________________
add_20 (Add)                    (None, 143, 191, 256 0           batch_normalization_65[0][0]
                                                                 batch_normalization_66[0][0]
__________________________________________________________________________________________________
activation_62 (Activation)      (None, 143, 191, 256 0           add_20[0][0]
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 143, 191, 64) 16448       activation_62[0][0]
__________________________________________________________________________________________________
batch_normalization_67 (BatchNo (None, 143, 191, 64) 256         conv2d_70[0][0]
__________________________________________________________________________________________________
activation_63 (Activation)      (None, 143, 191, 64) 0           batch_normalization_67[0][0]
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 143, 191, 64) 36928       activation_63[0][0]
__________________________________________________________________________________________________
batch_normalization_68 (BatchNo (None, 143, 191, 64) 256         conv2d_71[0][0]
__________________________________________________________________________________________________
activation_64 (Activation)      (None, 143, 191, 64) 0           batch_normalization_68[0][0]
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 143, 191, 256 16640       activation_64[0][0]
__________________________________________________________________________________________________
batch_normalization_69 (BatchNo (None, 143, 191, 256 1024        conv2d_72[0][0]
__________________________________________________________________________________________________
add_21 (Add)                    (None, 143, 191, 256 0           batch_normalization_69[0][0]
                                                                 activation_62[0][0]
__________________________________________________________________________________________________
activation_65 (Activation)      (None, 143, 191, 256 0           add_21[0][0]
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 143, 191, 64) 16448       activation_65[0][0]
__________________________________________________________________________________________________
batch_normalization_70 (BatchNo (None, 143, 191, 64) 256         conv2d_73[0][0]
__________________________________________________________________________________________________
activation_66 (Activation)      (None, 143, 191, 64) 0           batch_normalization_70[0][0]
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 143, 191, 64) 36928       activation_66[0][0]
__________________________________________________________________________________________________
batch_normalization_71 (BatchNo (None, 143, 191, 64) 256         conv2d_74[0][0]
__________________________________________________________________________________________________
activation_67 (Activation)      (None, 143, 191, 64) 0           batch_normalization_71[0][0]
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 143, 191, 256 16640       activation_67[0][0]
__________________________________________________________________________________________________
batch_normalization_72 (BatchNo (None, 143, 191, 256 1024        conv2d_75[0][0]
__________________________________________________________________________________________________
add_22 (Add)                    (None, 143, 191, 256 0           batch_normalization_72[0][0]
                                                                 activation_65[0][0]
__________________________________________________________________________________________________
activation_68 (Activation)      (None, 143, 191, 256 0           add_22[0][0]
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 72, 96, 128)  32896       activation_68[0][0]
__________________________________________________________________________________________________
batch_normalization_73 (BatchNo (None, 72, 96, 128)  512         conv2d_76[0][0]
__________________________________________________________________________________________________
activation_69 (Activation)      (None, 72, 96, 128)  0           batch_normalization_73[0][0]
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 72, 96, 128)  147584      activation_69[0][0]
__________________________________________________________________________________________________
batch_normalization_74 (BatchNo (None, 72, 96, 128)  512         conv2d_77[0][0]
__________________________________________________________________________________________________
activation_70 (Activation)      (None, 72, 96, 128)  0           batch_normalization_74[0][0]
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 72, 96, 512)  66048       activation_70[0][0]
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 72, 96, 512)  131584      activation_68[0][0]
__________________________________________________________________________________________________
batch_normalization_75 (BatchNo (None, 72, 96, 512)  2048        conv2d_78[0][0]
__________________________________________________________________________________________________
batch_normalization_76 (BatchNo (None, 72, 96, 512)  2048        conv2d_79[0][0]
__________________________________________________________________________________________________
add_23 (Add)                    (None, 72, 96, 512)  0           batch_normalization_75[0][0]
                                                                 batch_normalization_76[0][0]
__________________________________________________________________________________________________
activation_71 (Activation)      (None, 72, 96, 512)  0           add_23[0][0]
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 72, 96, 128)  65664       activation_71[0][0]
__________________________________________________________________________________________________
batch_normalization_77 (BatchNo (None, 72, 96, 128)  512         conv2d_80[0][0]
__________________________________________________________________________________________________
activation_72 (Activation)      (None, 72, 96, 128)  0           batch_normalization_77[0][0]
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 72, 96, 128)  147584      activation_72[0][0]
__________________________________________________________________________________________________
batch_normalization_78 (BatchNo (None, 72, 96, 128)  512         conv2d_81[0][0]
__________________________________________________________________________________________________
activation_73 (Activation)      (None, 72, 96, 128)  0           batch_normalization_78[0][0]
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 72, 96, 512)  66048       activation_73[0][0]
__________________________________________________________________________________________________
batch_normalization_79 (BatchNo (None, 72, 96, 512)  2048        conv2d_82[0][0]
__________________________________________________________________________________________________
add_24 (Add)                    (None, 72, 96, 512)  0           batch_normalization_79[0][0]
                                                                 activation_71[0][0]
__________________________________________________________________________________________________
activation_74 (Activation)      (None, 72, 96, 512)  0           add_24[0][0]
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 72, 96, 128)  65664       activation_74[0][0]
__________________________________________________________________________________________________
batch_normalization_80 (BatchNo (None, 72, 96, 128)  512         conv2d_83[0][0]
__________________________________________________________________________________________________
activation_75 (Activation)      (None, 72, 96, 128)  0           batch_normalization_80[0][0]
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 72, 96, 128)  147584      activation_75[0][0]
__________________________________________________________________________________________________
batch_normalization_81 (BatchNo (None, 72, 96, 128)  512         conv2d_84[0][0]
__________________________________________________________________________________________________
activation_76 (Activation)      (None, 72, 96, 128)  0           batch_normalization_81[0][0]
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 72, 96, 512)  66048       activation_76[0][0]
__________________________________________________________________________________________________
batch_normalization_82 (BatchNo (None, 72, 96, 512)  2048        conv2d_85[0][0]
__________________________________________________________________________________________________
add_25 (Add)                    (None, 72, 96, 512)  0           batch_normalization_82[0][0]
                                                                 activation_74[0][0]
__________________________________________________________________________________________________
activation_77 (Activation)      (None, 72, 96, 512)  0           add_25[0][0]
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 72, 96, 128)  65664       activation_77[0][0]
__________________________________________________________________________________________________
batch_normalization_83 (BatchNo (None, 72, 96, 128)  512         conv2d_86[0][0]
__________________________________________________________________________________________________
activation_78 (Activation)      (None, 72, 96, 128)  0           batch_normalization_83[0][0]
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 72, 96, 128)  147584      activation_78[0][0]
__________________________________________________________________________________________________
batch_normalization_84 (BatchNo (None, 72, 96, 128)  512         conv2d_87[0][0]
__________________________________________________________________________________________________
activation_79 (Activation)      (None, 72, 96, 128)  0           batch_normalization_84[0][0]
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 72, 96, 512)  66048       activation_79[0][0]
__________________________________________________________________________________________________
batch_normalization_85 (BatchNo (None, 72, 96, 512)  2048        conv2d_88[0][0]
__________________________________________________________________________________________________
add_26 (Add)                    (None, 72, 96, 512)  0           batch_normalization_85[0][0]
                                                                 activation_77[0][0]
__________________________________________________________________________________________________
activation_80 (Activation)      (None, 72, 96, 512)  0           add_26[0][0]
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 36, 48, 256)  131328      activation_80[0][0]
__________________________________________________________________________________________________
batch_normalization_86 (BatchNo (None, 36, 48, 256)  1024        conv2d_89[0][0]
__________________________________________________________________________________________________
activation_81 (Activation)      (None, 36, 48, 256)  0           batch_normalization_86[0][0]
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 36, 48, 256)  590080      activation_81[0][0]
__________________________________________________________________________________________________
batch_normalization_87 (BatchNo (None, 36, 48, 256)  1024        conv2d_90[0][0]
__________________________________________________________________________________________________
activation_82 (Activation)      (None, 36, 48, 256)  0           batch_normalization_87[0][0]
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 36, 48, 1024) 263168      activation_82[0][0]
__________________________________________________________________________________________________
conv2d_92 (Conv2D)              (None, 36, 48, 1024) 525312      activation_80[0][0]
__________________________________________________________________________________________________
batch_normalization_88 (BatchNo (None, 36, 48, 1024) 4096        conv2d_91[0][0]
__________________________________________________________________________________________________
batch_normalization_89 (BatchNo (None, 36, 48, 1024) 4096        conv2d_92[0][0]
__________________________________________________________________________________________________
add_27 (Add)                    (None, 36, 48, 1024) 0           batch_normalization_88[0][0]
                                                                 batch_normalization_89[0][0]
__________________________________________________________________________________________________
activation_83 (Activation)      (None, 36, 48, 1024) 0           add_27[0][0]
__________________________________________________________________________________________________
conv2d_93 (Conv2D)              (None, 36, 48, 256)  262400      activation_83[0][0]
__________________________________________________________________________________________________
batch_normalization_90 (BatchNo (None, 36, 48, 256)  1024        conv2d_93[0][0]
__________________________________________________________________________________________________
activation_84 (Activation)      (None, 36, 48, 256)  0           batch_normalization_90[0][0]
__________________________________________________________________________________________________
conv2d_94 (Conv2D)              (None, 36, 48, 256)  590080      activation_84[0][0]
__________________________________________________________________________________________________
batch_normalization_91 (BatchNo (None, 36, 48, 256)  1024        conv2d_94[0][0]
__________________________________________________________________________________________________
activation_85 (Activation)      (None, 36, 48, 256)  0           batch_normalization_91[0][0]
__________________________________________________________________________________________________
conv2d_95 (Conv2D)              (None, 36, 48, 1024) 263168      activation_85[0][0]
__________________________________________________________________________________________________
batch_normalization_92 (BatchNo (None, 36, 48, 1024) 4096        conv2d_95[0][0]
__________________________________________________________________________________________________
add_28 (Add)                    (None, 36, 48, 1024) 0           batch_normalization_92[0][0]
                                                                 activation_83[0][0]
__________________________________________________________________________________________________
activation_86 (Activation)      (None, 36, 48, 1024) 0           add_28[0][0]
__________________________________________________________________________________________________
conv2d_96 (Conv2D)              (None, 36, 48, 256)  262400      activation_86[0][0]
__________________________________________________________________________________________________
batch_normalization_93 (BatchNo (None, 36, 48, 256)  1024        conv2d_96[0][0]
__________________________________________________________________________________________________
activation_87 (Activation)      (None, 36, 48, 256)  0           batch_normalization_93[0][0]
__________________________________________________________________________________________________
conv2d_97 (Conv2D)              (None, 36, 48, 256)  590080      activation_87[0][0]
__________________________________________________________________________________________________
batch_normalization_94 (BatchNo (None, 36, 48, 256)  1024        conv2d_97[0][0]
__________________________________________________________________________________________________
activation_88 (Activation)      (None, 36, 48, 256)  0           batch_normalization_94[0][0]
__________________________________________________________________________________________________
conv2d_98 (Conv2D)              (None, 36, 48, 1024) 263168      activation_88[0][0]
__________________________________________________________________________________________________
batch_normalization_95 (BatchNo (None, 36, 48, 1024) 4096        conv2d_98[0][0]
__________________________________________________________________________________________________
add_29 (Add)                    (None, 36, 48, 1024) 0           batch_normalization_95[0][0]
                                                                 activation_86[0][0]
__________________________________________________________________________________________________
activation_89 (Activation)      (None, 36, 48, 1024) 0           add_29[0][0]
__________________________________________________________________________________________________
conv2d_99 (Conv2D)              (None, 36, 48, 256)  262400      activation_89[0][0]
__________________________________________________________________________________________________
batch_normalization_96 (BatchNo (None, 36, 48, 256)  1024        conv2d_99[0][0]
__________________________________________________________________________________________________
activation_90 (Activation)      (None, 36, 48, 256)  0           batch_normalization_96[0][0]
__________________________________________________________________________________________________
conv2d_100 (Conv2D)             (None, 36, 48, 256)  590080      activation_90[0][0]
__________________________________________________________________________________________________
batch_normalization_97 (BatchNo (None, 36, 48, 256)  1024        conv2d_100[0][0]
__________________________________________________________________________________________________
activation_91 (Activation)      (None, 36, 48, 256)  0           batch_normalization_97[0][0]
__________________________________________________________________________________________________
conv2d_101 (Conv2D)             (None, 36, 48, 1024) 263168      activation_91[0][0]
__________________________________________________________________________________________________
batch_normalization_98 (BatchNo (None, 36, 48, 1024) 4096        conv2d_101[0][0]
__________________________________________________________________________________________________
add_30 (Add)                    (None, 36, 48, 1024) 0           batch_normalization_98[0][0]
                                                                 activation_89[0][0]
__________________________________________________________________________________________________
activation_92 (Activation)      (None, 36, 48, 1024) 0           add_30[0][0]
__________________________________________________________________________________________________
conv2d_102 (Conv2D)             (None, 36, 48, 256)  262400      activation_92[0][0]
__________________________________________________________________________________________________
batch_normalization_99 (BatchNo (None, 36, 48, 256)  1024        conv2d_102[0][0]
__________________________________________________________________________________________________
activation_93 (Activation)      (None, 36, 48, 256)  0           batch_normalization_99[0][0]
__________________________________________________________________________________________________
conv2d_103 (Conv2D)             (None, 36, 48, 256)  590080      activation_93[0][0]
__________________________________________________________________________________________________
batch_normalization_100 (BatchN (None, 36, 48, 256)  1024        conv2d_103[0][0]
__________________________________________________________________________________________________
activation_94 (Activation)      (None, 36, 48, 256)  0           batch_normalization_100[0][0]
__________________________________________________________________________________________________
conv2d_104 (Conv2D)             (None, 36, 48, 1024) 263168      activation_94[0][0]
__________________________________________________________________________________________________
batch_normalization_101 (BatchN (None, 36, 48, 1024) 4096        conv2d_104[0][0]
__________________________________________________________________________________________________
add_31 (Add)                    (None, 36, 48, 1024) 0           batch_normalization_101[0][0]
                                                                 activation_92[0][0]
__________________________________________________________________________________________________
activation_95 (Activation)      (None, 36, 48, 1024) 0           add_31[0][0]
__________________________________________________________________________________________________
conv2d_105 (Conv2D)             (None, 36, 48, 256)  262400      activation_95[0][0]
__________________________________________________________________________________________________
batch_normalization_102 (BatchN (None, 36, 48, 256)  1024        conv2d_105[0][0]
__________________________________________________________________________________________________
activation_96 (Activation)      (None, 36, 48, 256)  0           batch_normalization_102[0][0]
__________________________________________________________________________________________________
conv2d_106 (Conv2D)             (None, 36, 48, 256)  590080      activation_96[0][0]
__________________________________________________________________________________________________
batch_normalization_103 (BatchN (None, 36, 48, 256)  1024        conv2d_106[0][0]
__________________________________________________________________________________________________
activation_97 (Activation)      (None, 36, 48, 256)  0           batch_normalization_103[0][0]
__________________________________________________________________________________________________
conv2d_107 (Conv2D)             (None, 36, 48, 1024) 263168      activation_97[0][0]
__________________________________________________________________________________________________
batch_normalization_104 (BatchN (None, 36, 48, 1024) 4096        conv2d_107[0][0]
__________________________________________________________________________________________________
add_32 (Add)                    (None, 36, 48, 1024) 0           batch_normalization_104[0][0]
                                                                 activation_95[0][0]
__________________________________________________________________________________________________
activation_98 (Activation)      (None, 36, 48, 1024) 0           add_32[0][0]
__________________________________________________________________________________________________
conv2d_108 (Conv2D)             (None, 18, 24, 512)  524800      activation_98[0][0]
__________________________________________________________________________________________________
batch_normalization_105 (BatchN (None, 18, 24, 512)  2048        conv2d_108[0][0]
__________________________________________________________________________________________________
activation_99 (Activation)      (None, 18, 24, 512)  0           batch_normalization_105[0][0]
__________________________________________________________________________________________________
conv2d_109 (Conv2D)             (None, 18, 24, 512)  2359808     activation_99[0][0]
__________________________________________________________________________________________________
batch_normalization_106 (BatchN (None, 18, 24, 512)  2048        conv2d_109[0][0]
__________________________________________________________________________________________________
activation_100 (Activation)     (None, 18, 24, 512)  0           batch_normalization_106[0][0]
__________________________________________________________________________________________________
conv2d_110 (Conv2D)             (None, 18, 24, 2048) 1050624     activation_100[0][0]
__________________________________________________________________________________________________
conv2d_111 (Conv2D)             (None, 18, 24, 2048) 2099200     activation_98[0][0]
__________________________________________________________________________________________________
batch_normalization_107 (BatchN (None, 18, 24, 2048) 8192        conv2d_110[0][0]
__________________________________________________________________________________________________
batch_normalization_108 (BatchN (None, 18, 24, 2048) 8192        conv2d_111[0][0]
__________________________________________________________________________________________________
add_33 (Add)                    (None, 18, 24, 2048) 0           batch_normalization_107[0][0]
                                                                 batch_normalization_108[0][0]
__________________________________________________________________________________________________
activation_101 (Activation)     (None, 18, 24, 2048) 0           add_33[0][0]
__________________________________________________________________________________________________
conv2d_112 (Conv2D)             (None, 18, 24, 512)  1049088     activation_101[0][0]
__________________________________________________________________________________________________
batch_normalization_109 (BatchN (None, 18, 24, 512)  2048        conv2d_112[0][0]
__________________________________________________________________________________________________
activation_102 (Activation)     (None, 18, 24, 512)  0           batch_normalization_109[0][0]
__________________________________________________________________________________________________
conv2d_113 (Conv2D)             (None, 18, 24, 512)  2359808     activation_102[0][0]
__________________________________________________________________________________________________
batch_normalization_110 (BatchN (None, 18, 24, 512)  2048        conv2d_113[0][0]
__________________________________________________________________________________________________
activation_103 (Activation)     (None, 18, 24, 512)  0           batch_normalization_110[0][0]
__________________________________________________________________________________________________
conv2d_114 (Conv2D)             (None, 18, 24, 2048) 1050624     activation_103[0][0]
__________________________________________________________________________________________________
batch_normalization_111 (BatchN (None, 18, 24, 2048) 8192        conv2d_114[0][0]
__________________________________________________________________________________________________
add_34 (Add)                    (None, 18, 24, 2048) 0           batch_normalization_111[0][0]
                                                                 activation_101[0][0]
__________________________________________________________________________________________________
activation_104 (Activation)     (None, 18, 24, 2048) 0           add_34[0][0]
__________________________________________________________________________________________________
conv2d_115 (Conv2D)             (None, 18, 24, 512)  1049088     activation_104[0][0]
__________________________________________________________________________________________________
batch_normalization_112 (BatchN (None, 18, 24, 512)  2048        conv2d_115[0][0]
__________________________________________________________________________________________________
activation_105 (Activation)     (None, 18, 24, 512)  0           batch_normalization_112[0][0]
__________________________________________________________________________________________________
conv2d_116 (Conv2D)             (None, 18, 24, 512)  2359808     activation_105[0][0]
__________________________________________________________________________________________________
batch_normalization_113 (BatchN (None, 18, 24, 512)  2048        conv2d_116[0][0]
__________________________________________________________________________________________________
activation_106 (Activation)     (None, 18, 24, 512)  0           batch_normalization_113[0][0]
__________________________________________________________________________________________________
conv2d_117 (Conv2D)             (None, 18, 24, 2048) 1050624     activation_106[0][0]
__________________________________________________________________________________________________
batch_normalization_114 (BatchN (None, 18, 24, 2048) 8192        conv2d_117[0][0]
__________________________________________________________________________________________________
add_35 (Add)                    (None, 18, 24, 2048) 0           batch_normalization_114[0][0]
                                                                 activation_104[0][0]
__________________________________________________________________________________________________
activation_107 (Activation)     (None, 18, 24, 2048) 0           add_35[0][0]
__________________________________________________________________________________________________
average_pooling2d_5 (AveragePoo (None, 1, 1, 2048)   0           activation_107[0][0]
__________________________________________________________________________________________________
average_pooling2d_6 (AveragePoo (None, 2, 2, 2048)   0           activation_107[0][0]
__________________________________________________________________________________________________
average_pooling2d_7 (AveragePoo (None, 3, 3, 2048)   0           activation_107[0][0]
__________________________________________________________________________________________________
average_pooling2d_8 (AveragePoo (None, 6, 6, 2048)   0           activation_107[0][0]
__________________________________________________________________________________________________
conv2d_118 (Conv2D)             (None, 1, 1, 512)    1048576     average_pooling2d_5[0][0]
__________________________________________________________________________________________________
conv2d_119 (Conv2D)             (None, 2, 2, 512)    1048576     average_pooling2d_6[0][0]
__________________________________________________________________________________________________
conv2d_120 (Conv2D)             (None, 3, 3, 512)    1048576     average_pooling2d_7[0][0]
__________________________________________________________________________________________________
conv2d_121 (Conv2D)             (None, 6, 6, 512)    1048576     average_pooling2d_8[0][0]
__________________________________________________________________________________________________
batch_normalization_115 (BatchN (None, 1, 1, 512)    2048        conv2d_118[0][0]
__________________________________________________________________________________________________
batch_normalization_116 (BatchN (None, 2, 2, 512)    2048        conv2d_119[0][0]
__________________________________________________________________________________________________
batch_normalization_117 (BatchN (None, 3, 3, 512)    2048        conv2d_120[0][0]
__________________________________________________________________________________________________
batch_normalization_118 (BatchN (None, 6, 6, 512)    2048        conv2d_121[0][0]
__________________________________________________________________________________________________
activation_108 (Activation)     (None, 1, 1, 512)    0           batch_normalization_115[0][0]
__________________________________________________________________________________________________
activation_109 (Activation)     (None, 2, 2, 512)    0           batch_normalization_116[0][0]
__________________________________________________________________________________________________
activation_110 (Activation)     (None, 3, 3, 512)    0           batch_normalization_117[0][0]
__________________________________________________________________________________________________
activation_111 (Activation)     (None, 6, 6, 512)    0           batch_normalization_118[0][0]
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 18, 24, 512)  0           activation_108[0][0]
__________________________________________________________________________________________________
lambda_12 (Lambda)              (None, 18, 24, 512)  0           activation_109[0][0]
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, 18, 24, 512)  0           activation_110[0][0]
__________________________________________________________________________________________________
lambda_14 (Lambda)              (None, 18, 24, 512)  0           activation_111[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 18, 24, 4096) 0           activation_107[0][0]
                                                                 lambda_11[0][0]
                                                                 lambda_12[0][0]
                                                                 lambda_13[0][0]
                                                                 lambda_14[0][0]
__________________________________________________________________________________________________
conv2d_122 (Conv2D)             (None, 18, 24, 512)  2097152     concatenate_2[0][0]
__________________________________________________________________________________________________
batch_normalization_119 (BatchN (None, 18, 24, 512)  2048        conv2d_122[0][0]
__________________________________________________________________________________________________
activation_112 (Activation)     (None, 18, 24, 512)  0           batch_normalization_119[0][0]
__________________________________________________________________________________________________
conv2d_123 (Conv2D)             (None, 18, 24, 1024) 524288      activation_112[0][0]
__________________________________________________________________________________________________
lambda_15 (Lambda)              (None, 36, 48, 1024) 0           conv2d_123[0][0]
__________________________________________________________________________________________________
add_36 (Add)                    (None, 36, 48, 1024) 0           lambda_15[0][0]
                                                                 activation_98[0][0]
__________________________________________________________________________________________________
conv2d_124 (Conv2D)             (None, 36, 48, 512)  524288      add_36[0][0]
__________________________________________________________________________________________________
batch_normalization_120 (BatchN (None, 36, 48, 512)  2048        conv2d_124[0][0]
__________________________________________________________________________________________________
activation_113 (Activation)     (None, 36, 48, 512)  0           batch_normalization_120[0][0]
__________________________________________________________________________________________________
lambda_16 (Lambda)              (None, 72, 96, 512)  0           activation_113[0][0]
__________________________________________________________________________________________________
add_37 (Add)                    (None, 72, 96, 512)  0           lambda_16[0][0]
                                                                 activation_80[0][0]
__________________________________________________________________________________________________
conv2d_125 (Conv2D)             (None, 72, 96, 512)  262144      add_37[0][0]
__________________________________________________________________________________________________
batch_normalization_121 (BatchN (None, 72, 96, 512)  2048        conv2d_125[0][0]
__________________________________________________________________________________________________
activation_114 (Activation)     (None, 72, 96, 512)  0           batch_normalization_121[0][0]
__________________________________________________________________________________________________
conv2d_126 (Conv2D)             (None, 72, 96, 256)  131072      activation_114[0][0]
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 145, 193, 256 0           activation_68[0][0]
__________________________________________________________________________________________________
lambda_17 (Lambda)              (None, 144, 192, 256 0           conv2d_126[0][0]
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 144, 192, 256 0           zero_padding2d_4[0][0]
__________________________________________________________________________________________________
add_38 (Add)                    (None, 144, 192, 256 0           lambda_17[0][0]
                                                                 lambda_10[0][0]
__________________________________________________________________________________________________
conv2d_127 (Conv2D)             (None, 144, 192, 512 131072      add_38[0][0]
__________________________________________________________________________________________________
batch_normalization_122 (BatchN (None, 144, 192, 512 2048        conv2d_127[0][0]
__________________________________________________________________________________________________
activation_115 (Activation)     (None, 144, 192, 512 0           batch_normalization_122[0][0]
__________________________________________________________________________________________________
conv2d_128 (Conv2D)             (None, 144, 192, 10) 46090       activation_115[0][0]
__________________________________________________________________________________________________
lambda_18 (Lambda)              (None, 288, 384, 10) 0           conv2d_128[0][0]
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 110592, 10)   0           lambda_18[0][0]
__________________________________________________________________________________________________
activation_116 (Activation)     (None, 110592, 10)   0           reshape_2[0][0]
==================================================================================================
Total params: 31,514,506
Trainable params: 31,453,194
Non-trainable params: 61,312
__________________________________________________________________________________________________